use utf8;
no warnings qw(qw);
use open qw(:std :utf8);

use Test::More;
use Test::Deep;

use Lingua::RU::OpenCorpora::Tokenizer;

my @tests = (
    # exceptions
    [
        'Вася завел себе Яндекс.Кошелек',
        [qw(Вася завел себе Яндекс.Кошелек)],
    ],
    [
        'Петя сходил на концерт AC/DC',
        [qw(Петя сходил на концерт AC/DC)],
    ],
    [
        'Серёжа использует Yahoo! для поиска',
        [qw(Серёжа использует Yahoo! для поиска)],
    ],
    [
        q{Денис хочет поехать в Кот-д'Ивуар в отпуск},
        [qw(Денис хочет поехать в Кот-д'Ивуар в отпуск)],
    ],
    # tabs
    [
        "Привет,\tМир!",
        [qw(Привет , Мир !)],
    ],
    [
        "\tТаб",
        [qw(Таб)],
    ],
    [
        "Таб\t",
        [qw(Таб)],
    ],
    [
        "\tТаб\t",
        [qw(Таб)],
    ],
    # spaces
    [
        '    Пробелы',
        [qw(Пробелы)],
    ],
    [
        'Пробелы    ',
        [qw(Пробелы)],
    ],
    [
        '    Пробелы    ',
        [qw(Пробелы)],
    ],
    # issue #1 reported by kmike
    [
        'от 0 до 2',
        [qw(от 0 до 2)],
    ],
    [
        '0.Привет',
        [qw(0 . Привет)],
    ],
    # issue #2 reported by kmike
    [
        '. 6',
        [qw(. 6)],
    ],
    [
        '. 7',
        [qw(. 7)],
    ],
    [
        '. 0',
        [qw(. 0)],
    ],
    [
        'и выразительно скомпонованным . 2.5.4.4 . От импринтинга',
        [qw(и выразительно скомпонованным . 2.5.4.4 . От импринтинга)],
    ],
    [
        'определяется федеральным законодательством . 3 . Решение органа',
        [qw(определяется федеральным законодательством . 3 . Решение органа)],
    ],
);

plan tests => scalar @tests;

my $tokenizer = Lingua::RU::OpenCorpora::Tokenizer->new;

for my $t (@tests) {
    my $tokens = $tokenizer->tokens($t->[0]);
    cmp_deeply $tokens, $t->[1], "tokens: [$t->[0]]";
}
